#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""====================================
# @Time    : 2019/7/24 20:51
# @Author  : Jing
# @FileName: reverse_linked_list.py
# @IDE: PyCharm
# @ python程序员面试算法宝典 p22
======================================="""
##########################################
# 给定一个带头结点的单链表，请将其逆序。
# 即如果单链表原来为head->1一＞2->3->4->5一＞6一＞7
# 那么逆序后变为head一＞7一＞6一＞5->4->3>2->1
# ########################################
class LNode:
    def _new_(self, x):
        self.data = x
        self.next = None




